import React, { Component } from 'react'
import Scrollbars from 'react-custom-scrollbars';

export default class overflow extends Component {
    renderThumb({ style, ...props }) {//设置滚动条的样式
        const thumbStyle = {
            width: '8px',
            backgroundColor: '#000000',
            opacity: '0.2',
            borderRadius: '6px',
            right: '4px',
        };
        return (
            <div
            style={{ ...style, ...thumbStyle }}
            {...props}/>
        );
    }
    render() {
        return (
            <div>
                <Scrollbars 
                    style={{ height: 100, width:310, border:'1px solid Pink', margin:'5rem auto'}}
                    renderThumbVertical={this.renderThumb}
                    // autoHide
                    >
                    <ul style={{width:300}}>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                    </ul>
                </Scrollbars>
                <div>
                <Scrollbars 
                    style={{ height: 100, width:310, border:'1px solid Pink', margin:'5rem auto'}}
                    // renderThumbVertical={this.renderThumb}
                    // autoHide
                    >
                    <ul style={{width:300}}>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                        <li>老当益壮，宁移白首之心？穷且益坚，不坠青云之志。</li>
                    </ul>
                </Scrollbars>
                </div>
            </div>
        )
    }
}
